[
    {
        "style": "D",
        "question": "Saya berkembang di lingkungan yang serba cepat di mana saya bisa memimpin dan mengambil keputusan dengan cepat.",
        "mapping": {
            "D": 2,
            "I": 1,
            "S": -1,
            "C": 0
        }
    },
    {
        "style": "I",
        "question": "Saya benar-benar menikmati bekerja sama dengan orang lain dan membangun hubungan yang kuat dalam sebuah tim.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 1,
            "C": -1
        }
    },
    {
        "style": "C",
        "question": "Saya merasa sangat puas ketika bisa merencanakan dengan teliti dan memastikan setiap detail diperhatikan.",
        "mapping": {
            "D": 0,
            "I": 0,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "S",
        "question": "Saya mengutamakan menjaga keharmonisan dan percaya bahwa menemukan titik temu adalah cara terbaik menyelesaikan konflik secara damai.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "D",
        "question": "Saya secara alami tertarik pada peran kepemimpinan dan merasa nyaman mengambil inisiatif dalam kelompok.",
        "mapping": {
            "D": 2,
            "I": 1,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "Saya memiliki bakat untuk menginspirasi orang lain dan senang membagikan antusiasme saya agar orang lain tertarik dengan ide-ide saya.",
        "mapping": {
            "D": 1,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "S",
        "question": "Saya menghargai kenyamanan rutinitas dan lebih suka struktur yang dapat diprediksi dalam aktivitas sehari-hari saya.",
        "mapping": {
            "D": -1,
            "I": -1,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "C",
        "question": "Saya sangat teliti dan bangga menghasilkan pekerjaan yang presisi dan akurat.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "D",
        "question": "Saya merasa paling nyaman ketika saya memahami dengan jelas tanggung jawab saya dan dapat mengendalikan tugas-tugas saya.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": -1,
            "C": 0
        }
    },
    {
        "style": "I",
        "question": "Saya senang menjadi pusat perhatian dan mudah bergaul dengan orang lain dalam situasi sosial.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "S",
        "question": "Saya menghargai stabilitas dan lebih suka lingkungan yang tenang dan dapat diprediksi.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "C",
        "question": "Saya merasa nyaman menganalisis data dan menggunakan logika untuk memecahkan masalah yang kompleks.",
        "mapping": {
            "D": -1,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "D",
        "question": "Saya merasa bersemangat menghadapi tantangan dan senang berpikir cepat dalam situasi penuh tekanan.",
        "mapping": {
            "D": 2,
            "I": 1,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "Saya adalah orang yang mudah bergaul dan mudah membangun hubungan baik dengan berbagai macam orang.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 1,
            "C": 0
        }
    },
    {
        "style": "S",
        "question": "Saya cenderung berhati-hati dan lebih suka mempertimbangkan pilihan dengan matang sebelum mengambil risiko.",
        "mapping": {
            "D": -2,
            "I": -1,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "C",
        "question": "Saya memiliki standar tinggi untuk diri sendiri dan orang lain, serta selalu berusaha mencapai keunggulan dalam segala hal yang saya lakukan.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "D",
        "question": "Saya menghargai kejujuran dan komunikasi yang langsung, meskipun itu berarti harus melakukan percakapan yang sulit.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": -1,
            "C": 0
        }
    },
    {
        "style": "S",
        "question": "Saya percaya pada kekuatan kolaborasi dan lebih suka bekerja dalam tim di mana setiap suara didengar.",
        "mapping": {
            "D": 0,
            "I": 1,
            "S": 2,
            "C": 0
        }
    },
    {
        "style": "C",
        "question": "Saya senang mendalami informasi yang kompleks dan menemukan pola atau wawasan yang mungkin terlewat oleh orang lain.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 0,
            "C": 2
        }
    },
    {
        "style": "D",
        "question": "Saya selalu mencari peluang baru untuk belajar dan berkembang, baik secara pribadi maupun profesional.",
        "mapping": {
            "D": 2,
            "I": 1,
            "S": -1,
            "C": 0
        }
    },
    {
        "style": "S",
        "question": "Saya berusaha menjaga hubungan yang positif dan menghindari konflik yang tidak perlu kapan pun memungkinkan.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "C",
        "question": "Saya bangga dengan kemampuan saya membuat rencana yang terstruktur dengan baik dan mengeksekusinya dengan sempurna.",
        "mapping": {
            "D": 0,
            "I": 0,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "D",
        "question": "Saya bersedia membuat keputusan yang sulit dan berpegang teguh pada pendapat saya, bahkan jika itu berarti menghadapi oposisi atau perbedaan pendapat.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": -1,
            "C": 1
        }
    },
    {
        "style": "I",
        "question": "Saya senang berbagi kegembiraan saya dengan orang lain dan dapat dengan mudah membuat orang lain terinspirasi oleh ide saya.",
        "mapping": {
            "D": 1,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "S",
        "question": "Saya bangga dengan keandalan dan konsistensi dalam segala hal yang saya lakukan.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "C",
        "question": "Saya memastikan akurasi dengan memeriksa pekerjaan saya secara cermat untuk menghindari kesalahan.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "D",
        "question": "Saya senang bekerja dalam lingkungan yang memungkinkan saya membuat keputusan cepat dan bergerak maju tanpa perlu banyak berpikir.",
        "mapping": {
            "D": 2,
            "I": 1,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "D",
        "question": "Saya yakin mengambil alih dalam situasi di mana orang lain mungkin ragu atau tidak yakin.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": -1,
            "C": 0
        }
    },
    {
        "style": "D",
        "question": "Saya senang menetapkan tujuan yang berani dan mendorong diri sendiri untuk mencapai mereka, bahkan ketika peluang berlawanan dengan saya.",
        "mapping": {
            "D": 2,
            "I": 1,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "Saya sering menemukan diri saya memotivasi orang lain dengan semangat dan sikap positif saya.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 1,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "Saya merasa energik ketika saya berada di sekitar orang dan menikmati berinteraksi dengan mereka secara teratur.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "S",
        "question": "Saya cenderung menghindari konfrontasi dan lebih suka memecahkan perselisihan melalui pemahaman dan kompromi.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "Saya merasa puas dengan menjaga hubungan jangka panjang dan membantu orang lain merasa nyaman.",
        "mapping": {
            "D": -1,
            "I": 1,
            "S": 2,
            "C": 0
        }
    },
    {
        "style": "C",
        "question": "Saya senang bekerja dalam lingkungan yang terstruktur di mana tugas-tugas jelas dan harapan jelas.",
        "mapping": {
            "D": -1,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "Saya sangat sistematis dalam pendekatan saya dan memastikan bahwa setiap langkah dalam proses diikuti dengan tepat.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "D",
        "question": "Saya lebih suka membuat keputusan cepat dan tegas daripada berpikir terlalu banyak tentang setiap detail.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": -1,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "Saya senang dengan ide untuk bertemu dengan orang baru dan membentuk koneksi dengan orang di sekitar saya.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "S",
        "question": "Saya lebih suka lingkungan yang tenang dan stabil, di mana perubahan mendadak jarang terjadi dan hal-hal berjalan sesuai rencana.",
        "mapping": {
            "D": -1,
            "I": -1,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "C",
        "question": "Saya cenderung fokus pada akurasi detail dan selalu memeriksa pekerjaan saya untuk kesalahan.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "D",
        "question": "Saya senang bekerja dalam lingkungan yang kompetitif dan menikmati berjuang untuk menjadi yang terbaik dalam apa yang saya lakukan.",
        "mapping": {
            "D": 2,
            "I": 1,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "S",
        "question": "Saya lebih suka memainkan peran mendukung, membantu orang lain mencapai tujuan mereka daripada berada di tengah perhatian.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 0
        }
    },
    {
        "style": "I",
        "question": "Saya sering menikmati berbagi cerita atau pengalaman untuk menghibur atau memotivasi orang di sekitar saya.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "C",
        "question": "Saya didorong oleh kebutuhan untuk konsistensi dan akurasi, dan saya tidak suka ketika hal-hal tidak selesai atau kotor.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "D",
        "question": "Saya tidak suka ketika saya harus menunggu orang lain untuk membuat keputusan.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": -1,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "Saya tidak suka menghabiskan waktu lama bekerja sendirian tanpa interaksi dengan orang lain.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "S",
        "question": "Saya tidak suka lingkungan yang selalu berubah dan tidak dapat diprediksi.",
        "mapping": {
            "D": -1,
            "I": -1,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "C",
        "question": "Saya tidak suka membuat keputusan berdasarkan informasi yang tidak lengkap atau keputusan yang didasarkan pada perkiraan.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "D",
        "question": "Saya tidak suka berada dalam situasi di mana saya tidak memiliki kontrol atas hasilnya.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": -1,
            "C": 0
        }
    },
    {
        "style": "I",
        "question": "Saya tidak suka bekerja sendirian tanpa umpan balik atau pengakuan dari orang lain.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "S",
        "question": "Saya tidak suka situasi yang melibatkan konflik atau perselisihan.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "C",
        "question": "Saya tidak suka menangani tugas yang membutuhkan kreativitas lebih dari akurasi dan ketepatan.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "D",
        "question": "Saya tidak suka mengikuti arahan dari orang lain tanpa bisa memberikan input atau saran.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": -1,
            "C": 0
        }
    },
    {
        "style": "I",
        "question": "Saya tidak suka tugas rutin yang tidak melibatkan interaksi dengan orang lain.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "S",
        "question": "Saya tidak suka bekerja dalam lingkungan yang cepat dan bertekanan.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "C",
        "question": "Saya tidak suka situasi di mana aturan tidak jelas atau sering berubah.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "D",
        "question": "Saya tidak suka situasi di mana saya bukan yang mengarahkan usaha atau membuat keputusan.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": -1,
            "C": 0
        }
    },
    {
        "style": "I",
        "question": "Saya tidak suka bekerja dalam lingkungan di mana saya tidak dapat berinteraksi dan berkolaborasi.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "S",
        "question": "Saya tidak suka dibebani untuk membuat keputusan cepat tanpa cukup waktu untuk memikirkan hal-hal itu.",
        "mapping": {
            "D": -1,
            "I": -1,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "C",
        "question": "Saya tidak suka bekerja dalam lingkungan di mana ada sedikit pengaruh pada akurasi atau perhatian terhadap detail.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "I",
        "question": "Saya senang berpartisipasi dalam kegiatan grup di mana saya dapat berhubungan dengan berbagai orang.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 1,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "Saya menemukan mudah untuk memotivasi dan menggerakkan orang lain dalam situasi tim.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "Saya nyaman berbicara di depan audiensi besar dan menikmati berbagi ide-ide saya.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "Saya berhasil dalam lingkungan di mana saya dapat berinteraksi dengan orang lain secara teratur dan membangun hubungan.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 1,
            "C": 0
        }
    },
    {
        "style": "I",
        "question": "Saya lebih suka sesi brainstorming di mana saya dapat berkolaborasi pada ide-ide dengan orang lain.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 1,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "Saya merasa memuaskan dalam membantu orang lain melihat gambaran besar dan memotivasi mereka untuk mencapai tujuan bersama.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 1,
            "C": 0
        }
    },
    {
        "style": "I",
        "question": "Saya berpengalaman dalam membangun kesepahaman di antara kelompok yang berbeda.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 1,
            "C": 0
        }
    },
    {
        "style": "I",
        "question": "Saya menikmati mengambil alih kepemimpinan dalam acara sosial dan membangun rasa komunitas.",
        "mapping": {
            "D": 1,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "Saya dikenal sebagai orang yang berpersuasi dan dapat mempengaruhi orang lain untuk mendukung ide-ide saya.",
        "mapping": {
            "D": 1,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "Saya berhasil dalam lingkungan di mana kreativitas dan berkolaborasi dihargai.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 1,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "Saya sering mengambil inisiatif untuk mencari tahu orang lain dan membangun hubungan.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "Saya menikmati mengenang kinerja orang lain dan membangun budaya tim yang positif.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 1,
            "C": 0
        }
    },
    {
        "style": "I",
        "question": "Saya bersemangat saat bekerja pada proyek yang memungkinkan saya berkolaborasi dengan beberapa departemen atau tim.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 1,
            "C": -1
        }
    },
    {
        "style": "I",
        "question": "Saya berpengalaman dalam networking dan menikmati membangun hubungan profesional jangka panjang.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 1,
            "C": 0
        }
    },
    {
        "style": "I",
        "question": "Saya termotivasi dengan pengakuan dari orang lain dan menikmati menerima umpan balik pada kontribusi saya.",
        "mapping": {
            "D": 0,
            "I": 2,
            "S": 1,
            "C": 0
        }
    },
    {
        "style": "C",
        "question": "Saya menikmati mengembangkan rencana detail dan mengikuti mereka dengan tepat untuk mencapai tujuan saya.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "Saya bangga dengan kemampuan saya untuk menjaga standar akurasi dan kualitas dalam pekerjaan saya.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "Saya lebih suka lingkungan di mana tugas jelas didefinisikan, dan ada cara terstruktur untuk menyelesaikannya.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "Saya sangat peduli untuk memastikan semua detail benar sebelum melanjutkan tugas.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "Saya nyaman menganalisis data kompleks dan memastikan semua hal terdaftar sebelum membuat keputusan.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "Saya berhasil dalam peran di mana perhatian terhadap detail dan akurasi sangat penting.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "Saya sangat terorganisir dan lebih suka memplan tugas saya secara terorganisir untuk memastikan efisiensi.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "Saya menghargai akurasi dan tidak suka situasi di mana ada keragu-raguan atau ketidakpastian.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "Saya lebih suka bekerja dalam lingkungan di mana ada aturan dan pedoman yang dibaca oleh semua orang.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "Saya menikmati proyek di mana saya dapat mengikuti langkah demi langkah untuk memastikan semua dilakukan dengan benar.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "Saya sering memeriksa pekerjaan saya untuk memastikan tidak ada kesalahan sebelum pengiriman.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "Saya termotivasi oleh kebutuhan untuk membuat proses yang baik, terorganisir, dan dapat diikuti oleh orang lain.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "Saya termotivasi oleh keinginan untuk menghasilkan pekerjaan bebas kesalahan dan memenuhi harapan yang tinggi.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "Saya lebih nyaman ketika saya memiliki tanggung jawab yang jelas dan dapat fokus pada detail.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "C",
        "question": "Saya tidak suka situasi dimana hanya ada sedikit kontrol atas kualitas dan akurasi.",
        "mapping": {
            "D": 0,
            "I": -1,
            "S": 1,
            "C": 2
        }
    },
    {
        "style": "D",
        "question": "Saya merasa berhasil ketika saya dapat mengambil alih situasi dan mengarahkan orang lain untuk mencapai tujuan.",
        "mapping": {
            "D": 2,
            "I": 1,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "D",
        "question": "Saya lebih suka menetapkan tujuan yang berani dan mendorong diri sendiri dan orang lain untuk mencapai tujuan.",
        "mapping": {
            "D": 2,
            "I": 1,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "D",
        "question": "Saya menikmati membuat keputusan cepat dan tidak ragu untuk bertindak ketika peluang muncul.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "D",
        "question": "Saya nyaman mengambil risiko jika itu menghasilkan reward yang lebih besar.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "D",
        "question": "Saya tidak takut menantang status quo jika itu berarti menggerakkan progres.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": -1,
            "C": 0
        }
    },
    {
        "style": "D",
        "question": "Saya merasa yakin dalam kemampuan saya untuk memimpin tim dan membuat keputusan sulit.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": 0,
            "C": 0
        }
    },
    {
        "style": "D",
        "question": "Saya lebih suka lingkungan yang dinamis di mana saya dapat membuat dampak signifikan dengan cepat.",
        "mapping": {
            "D": 2,
            "I": 1,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "D",
        "question": "Saya menikmati bekerja dalam lingkungan di mana saya yang bertanggung jawab untuk hasil.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "D",
        "question": "Saya berhasil dalam kompetisi dan termotivasi untuk meningkatkan kinerja dibandingkan orang lain.",
        "mapping": {
            "D": 2,
            "I": 1,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "D",
        "question": "Saya nyaman menetapkan tanggung jawab atas kinerja orang lain untuk memenuhi standar yang tinggi.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": 0,
            "C": 0
        }
    },
    {
        "style": "D",
        "question": "Saya menikmati menghadapi tantangan yang sulit yang menguji keterampilan dan kekuatan.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": 0,
            "C": 0
        }
    },
    {
        "style": "D",
        "question": "Saya lebih suka memimpin proyek daripada mengikuti instruksi dari orang lain.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": -1,
            "C": 0
        }
    },
    {
        "style": "D",
        "question": "Saya bersedia mengambil keputusan yang tidak populer jika itu berarti mencapai keberhasilan jangka panjang.",
        "mapping": {
            "D": 2,
            "I": 0,
            "S": -1,
            "C": 0
        }
    },
    {
        "style": "D",
        "question": "Saya menikmati situasi di mana saya dapat memperlihatkan keahlian saya dan mengambil alih.",
        "mapping": {
            "D": 2,
            "I": 1,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "D",
        "question": "Saya terinspirasi oleh peluang yang memungkinkan saya berperan sebagai pemimpin dan mempengaruhi orang lain.",
        "mapping": {
            "D": 2,
            "I": 1,
            "S": 0,
            "C": -1
        }
    },
    {
        "style": "S",
        "question": "Saya berhasil dalam lingkungan di mana tugas dan harapan jelas didefinisikan dan jarang berubah.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "Saya lebih nyaman ketika saya dapat mengikuti rutinitas yang konsisten dan menghindari perubahan tak terduga.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "Saya lebih suka bekerja dalam lingkungan yang terstruktur di mana ada proses yang jelas dan sedikit perubahan.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "Saya menghargai hubungan jangka panjang dan menikmati bekerja dengan tim yang sama selama periode yang diperpanjang.",
        "mapping": {
            "D": -1,
            "I": 1,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "Saya merasa paling nyaman ketika saya dapat fokus pada satu tugas sekaligus, tanpa sering terinterupsi.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "Saya lebih suka alur kerja yang dapat diprediksi di mana saya tahu apa yang akan saya dapatkan setiap hari.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "Saya merasa paling produktif dalam lingkungan di mana stabilitas dan keandalan diprioritaskan daripada perubahan yang cepat.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "Saya lebih nyaman dengan peningkatan bertahap daripada perubahan besar yang mendadak.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "Saya menghargai pendekatan yang tenang dan konsisten dalam memecahkan masalah daripada berusaha mempercepat solusi.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "Saya lebih suka proyek jangka panjang yang memungkinkan saya bekerja sistematis menuju tujuan yang jelas.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "Saya menikmati lingkungan di mana perubahan direncanakan dan dikelola dengan hati-hati daripada terjadi secara tiba-tiba.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "Saya merasa lebih aman ketika saya tahu hasil atau konsekuensi dari tindakan saya.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "Saya menghargai lingkungan di mana stabilitas diprioritaskan dan perubahan tiba-tiba dihindari.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "Saya nyaman ketika saya dapat mempercayai proses yang sudah ada dan tahu bahwa hal-hal akan mengikuti pola yang dapat diprediksi.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    },
    {
        "style": "S",
        "question": "Saya lebih suka bekerja dalam lingkungan di mana perubahan mendadak atau ketidakpastian jarang terjadi dan keputusan yang baik dipertimbangkan.",
        "mapping": {
            "D": -1,
            "I": 0,
            "S": 2,
            "C": 1
        }
    }
]
